{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense", 0, 0]], "name": "model", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, null], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, null], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding", "config": {"embeddings_constraint": null, "mask_zero": true, "input_dim": 9863, "dtype": "float32", "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding", "embeddings_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, null], "output_dim": 256, "trainable": true}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1", "config": {"embeddings_constraint": null, "mask_zero": true, "input_dim": 9863, "dtype": "float32", "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "embeddings_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, null], "output_dim": 256, "trainable": true}}, {"inbound_nodes": [[["embedding", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm", "config": {"implementation": 1, "units": 256, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "name": "lstm", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "unroll": false, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "stateful": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "use_bias": true, "return_state": true, "go_backwards": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}], ["lstm", 0, 1, {}], ["lstm", 0, 2, {}]]], "class_name": "LSTM", "name": "lstm_1", "config": {"implementation": 1, "units": 256, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "unroll": false, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "stateful": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "use_bias": true, "return_state": true, "go_backwards": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense", "config": {"units": 9863, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "trainable": true, "name": "dense", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}}}]}}, "keras_version": "2.1.6-tf", "training_config": {"metrics": [], "sample_weight_mode": null, "weighted_metrics": null, "loss_weights": null, "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of9", "group1-shard2of9", "group1-shard3of9", "group1-shard4of9", "group1-shard5of9", "group1-shard6of9", "group1-shard7of9", "group1-shard8of9", "group1-shard9of9"], "weights": [{"shape": [256, 9863], "dtype": "float32", "name": "AttSeq2Seq/dense/kernel"}, {"shape": [9863], "dtype": "float32", "name": "AttSeq2Seq/dense/bias"}, {"shape": [9863, 256], "dtype": "float32", "name": "AttSeq2Seq/embedding/embeddings"}, {"shape": [9863, 256], "dtype": "float32", "name": "AttSeq2Seq/embedding_1/embeddings"}, {"shape": [256, 1024], "dtype": "float32", "name": "AttSeq2Seq/lstm/kernel"}, {"shape": [256, 1024], "dtype": "float32", "name": "AttSeq2Seq/lstm/recurrent_kernel"}, {"shape": [1024], "dtype": "float32", "name": "AttSeq2Seq/lstm/bias"}, {"shape": [256, 1024], "dtype": "float32", "name": "AttSeq2Seq/lstm_1/kernel"}, {"shape": [256, 1024], "dtype": "float32", "name": "AttSeq2Seq/lstm_1/recurrent_kernel"}, {"shape": [1024], "dtype": "float32", "name": "AttSeq2Seq/lstm_1/bias"}]}]}